---
kind: type
id: T:Autodesk.Revit.UI.DoubleClickTarget
source: html/65ef60c8-d523-b2d0-4d3a-b9f2f4266f38.htm
---
# Autodesk.Revit.UI.DoubleClickTarget

Elements that support double-click in Revit. Note that this is meant to cover cases
 where the element itself is a double-click target. Individual controls that are targets
 are handled separately.

## Syntax (C#)
```csharp
public enum DoubleClickTarget
```